mrwillem/Caravan-Display/Utilities/STM32_EVAL/STM32F103C8T6/stm32f103c8t6_lcd_ili9341.c
/**
  ******************************************************************************
  * @file    stm3210b_eval_lcd.c
  * @author  MCD Application Team
  * @version V4.6.1
  * @date    18-April-2011
  * @brief   This file includes the LCD driver for AM-240320LTNQW00H (LCD_HX8312),
  *          AM-240320L8TNQW00H (LCD_ILI9320), AM-240320LDTNQW00H (LCD_SPFD5408B)
  *          Liquid Crystal Display Module of STM3210B-EVAL board.
  ******************************************************************************
  * @attention
  *
  * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
  * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
  * TIME. AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY
  * DIRECT, INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
  * FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
  * CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
  *
  * <h2><center>&copy; COPYRIGHT 2011 STMicroelectronics</center></h2>
  ******************************************************************************  
  */ 

/* Includes ------------------------------------------------------------------*/
#include "stm32f103c8t6_lcd.h"
#include "../Common/fonts.c"
#include "spi.h"

/** @addtogroup Utilities
  * @{
  */

/** @addtogroup STM32_EVAL
  * @{
  */ 

/** @addtogroup STM3210B_EVAL
  * @{
  */
    
/** @defgroup STM3210B_EVAL_LCD 
  * @briefThis file includes the LCD driver for AM-240320LTNQW00H (LCD_HX8312),
  *          AM-240320L8TNQW00H (LCD_ILI9320), AM-240320LDTNQW00H (LCD_SPFD5408B)
  *          Liquid Crystal Display Module of STM3210B-EVAL board.
  * @{
  */ 

/** @defgroup STM3210B_EVAL_LCD_Private_Types
  * @{
  */ 
/**
  * @}
  */ 


/** @defgroup STM3210B_EVAL_LCD_Private_Defines
  * @{
  */ 


#define START_BYTE         0x70
#define SET_INDEX          0x00
#define READ_STATUS        0x01
#define LCD_WRITE_REG      0x02
#define LCD_READ_REG       0x03
#define MAX_POLY_CORNERS   200
#define POLY_Y(Z)          ((int32_t)((Points + Z)->X))
#define POLY_X(Z)          ((int32_t)((Points + Z)->Y))
/**
  * @}
  */ 


/** @defgroup STM3210B_EVAL_LCD_Private_Macros
  * @{
  */
#define ABS(X)  ((X) > 0 ? (X) : -(X))   
/**
  * @}
  */ 


/** @defgroup STM3210B_EVAL_LCD_Private_Variables
  * @{
  */ 
static sFONT *LCD_Currentfonts;
/* Global variables to set the written text color */
static __IO uint16_t TextColor = 0x0000, BackColor = 0xFFFF;
static __IO uint32_t LCDType = LCD_ILI9320;
volatile uint8_t LCD_RX_Buffer[3];
volatile uint8_t LCD_TX_Buffer[3];
/**
  * @}
  */ 


/** @defgroup STM3210B_EVAL_LCD_Private_Function_Prototypes
  * @{
  */ 
#ifndef USE_Delay
static void delay(vu32 nCount);
#endif /* USE_Delay*/


static void LCD_WriteRegILI9341(uint8_t LCD_Reg);
static void PutPixel(int16_t x, int16_t y);
static void LCD_PolyLineRelativeClosed(pPoint Points, uint16_t PointCount, uint16_t Closed);
/**
  * @}
  */ 


/** @defgroup STM3210B_EVAL_LCD_Private_Functions
  * @{
  */ 

/**
  * @brief  DeInitializes the LCD.
  * @param  None
  * @retval None
  */
void LCD_DeInit(void)
{
  GPIO_InitTypeDef GPIO_InitStructure;

  /*!< LCD Display Off */
  LCD_DisplayOff();

  /*!< LCD_SPI disable */
  SPI_Cmd(LCD_SPI, DISABLE);
  
  /*!< LCD_SPI DeInit */
  SPI_I2S_DeInit(LCD_SPI);
   
  /*!< Disable SPI clock  */
  RCC_APB1PeriphClockCmd(LCD_SPI_CLK, DISABLE);
    
  /* Configure NCS in Output Push-Pull mode */
  GPIO_InitStructure.GPIO_Pin = LCD_NCS_PIN;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
  GPIO_Init(LCD_NCS_GPIO_PORT, &GPIO_InitStructure);
  
  /* Configure NWR(RNW), RS in Output Push-Pull mode */
  GPIO_InitStructure.GPIO_Pin = LCD_RS_PIN;
  GPIO_Init(LCD_RS_GPIO_PORT, &GPIO_InitStructure);

  GPIO_InitStructure.GPIO_Pin = LCD_NRST_PIN;
  GPIO_Init(LCD_NRST_GPIO_PORT, &GPIO_InitStructure);
  
  /* Configure SPI pins: SCK, MISO and MOSI */
  GPIO_InitStructure.GPIO_Pin = LCD_SPI_SCK_PIN;
  GPIO_Init(LCD_SPI_SCK_GPIO_PORT, &GPIO_InitStructure);

  GPIO_InitStructure.GPIO_Pin = LCD_SPI_MISO_PIN;
  GPIO_Init(LCD_SPI_MISO_GPIO_PORT, &GPIO_InitStructure);
  
  GPIO_InitStructure.GPIO_Pin = LCD_SPI_MOSI_PIN;
  GPIO_Init(LCD_SPI_MOSI_GPIO_PORT, &GPIO_InitStructure);
}

/**
  * @brief  Setups the LCD.
  * @param  None
  * @retval None
  */
void LCD_Setup(void)
{
	/* The SPI Interface should be up already */
	  /* Configure the LCD Control pins --------------------------------------------*/
	  LCD_CtrlLinesConfig();

	  /* Set Display Reset */
	  LCD_CtrlLinesWrite(LCD_NCS_GPIO_PORT, LCD_NCS_PIN, Bit_SET);
	  LCD_CtrlLinesWrite(LCD_NRST_GPIO_PORT, LCD_NRST_PIN, Bit_SET);
	  _delay_(5);
	  LCD_CtrlLinesWrite(LCD_NRST_GPIO_PORT, LCD_NRST_PIN, Bit_RESET);

	  _delay_(5); /* Delay 50 ms */
	  _delay_(50); /* Delay another 50 ms */
	  LCD_CtrlLinesWrite(LCD_NRST_GPIO_PORT, LCD_NRST_PIN, Bit_SET);
	  _delay_(5); /* Delay 50 ms */
	  _delay_(50); /* Delay 50 ms */
	  /* Issue Device Specific command */
	  LCD_WriteRegILI9341(0xCB);
	  LCD_WriteRAM(0x39);
	  LCD_WriteRAM(0x2C);
	  LCD_WriteRAM(0x00);
	  LCD_WriteRAM(0x34);
	  LCD_WriteRAM(0x02);

	  /* Issue another device specific command */
	  LCD_WriteRegILI9341(0xCF);
      LCD_WriteRAM(0x00);
      LCD_WriteRAM(0XC1);
      LCD_WriteRAM(0X30);

      LCD_WriteRegILI9341(0xE8);
      LCD_WriteRAM(0x85);
      LCD_WriteRAM(0x00);
      LCD_WriteRAM(0x78);

      LCD_WriteRegILI9341(0xEA);
      LCD_WriteRAM(0x00);
      LCD_WriteRAM(0x00);

      LCD_WriteRegILI9341(0xED);
      LCD_WriteRAM(0x64);
      LCD_WriteRAM(0x03);
      LCD_WriteRAM(0X12);
      LCD_WriteRAM(0X81);

      LCD_WriteRegILI9341(0xF7);
      LCD_WriteRAM(0x20);

      LCD_WriteRegILI9341(0xC0);    //Power control
      LCD_WriteRAM(0x23);   //VRH[5:0]

      LCD_WriteRegILI9341(0xC1);    //Power control
      LCD_WriteRAM(0x10);   //SAP[2:0];BT[3:0]

      LCD_WriteRegILI9341(0xC5);    //VCM control
      LCD_WriteRAM(0x3e);   //Contrast
      LCD_WriteRAM(0x28);

