mrwillem/Caravan-Display/Utilities/STM32_EVAL/STM32F103C8T6/stm32f103c8t6_lcd_ili9341.c
      LCD_WriteRegILI9341(0xC7);    //VCM control2
      LCD_WriteRAM(0x86);   //--

      LCD_WriteRegILI9341(0x36);    // Memory Access Control
      LCD_WriteRAM(0x48);   //C8	   //48 68//28 E8

      LCD_WriteRegILI9341(0x3A);
      LCD_WriteRAM(0x55);

      LCD_WriteRegILI9341(0xB1);
      LCD_WriteRAM(0x00);
      LCD_WriteRAM(0x18);

      LCD_WriteRegILI9341(0xB6);    // Display Function Control
      LCD_WriteRAM(0x08);
      LCD_WriteRAM(0x82);
      LCD_WriteRAM(0x27);

      /*
              LCD_WriteRegILI9341(0xF2);    // 3Gamma Function Disable
              LCD_WriteRAM(0x00);

              LCD_WriteRegILI9341(0x26);    //Gamma curve selected
              LCD_WriteRAM(0x01);

              LCD_WriteRegILI9341(0xE0);    //Set Gamma
              LCD_WriteRAM(0x0F);
              LCD_WriteRAM(0x31);
              LCD_WriteRAM(0x2B);
              LCD_WriteRAM(0x0C);
              LCD_WriteRAM(0x0E);
              LCD_WriteRAM(0x08);
              LCD_WriteRAM(0x4E);
              LCD_WriteRAM(0xF1);
              LCD_WriteRAM(0x37);
              LCD_WriteRAM(0x07);
              LCD_WriteRAM(0x10);
              LCD_WriteRAM(0x03);
              LCD_WriteRAM(0x0E);
              LCD_WriteRAM(0x09);
              LCD_WriteRAM(0x00);

              LCD_WriteRegILI9341(0XE1);    //Set Gamma
              LCD_WriteRAM(0x00);
              LCD_WriteRAM(0x0E);
              LCD_WriteRAM(0x14);
              LCD_WriteRAM(0x03);
              LCD_WriteRAM(0x11);
              LCD_WriteRAM(0x07);
              LCD_WriteRAM(0x31);
              LCD_WriteRAM(0xC1);
              LCD_WriteRAM(0x48);
              LCD_WriteRAM(0x08);
              LCD_WriteRAM(0x0F);
              LCD_WriteRAM(0x0C);
              LCD_WriteRAM(0x31);
              LCD_WriteRAM(0x36);
              LCD_WriteRAM(0x0F);
      */
      LCD_WriteRegILI9341(0x11);    //Exit Sleep
      _delay_(12);

      LCD_WriteRegILI9341(0x29);    //Display on
      LCD_WriteRegILI9341(0x2c);
      _delay_(1);

}


/**
  * @brief  Initializes the LCD.
  * @param  None
  * @retval None
  */
void STM32F103C8T6_LCD_Init(void)
{
  /* Setups the LCD */
  LCDType = LCD_ILI9341;
  LCD_Setup();

  LCD_SetFont(&LCD_DEFAULT_FONT);
}

/**
  * @brief  Sets the LCD Text and Background colors.
  * @param  _TextColor: specifies the Text Color.
  * @param  _BackColor: specifies the Background Color.
  * @retval None
  */
void LCD_SetColors(__IO uint16_t _TextColor, __IO uint16_t _BackColor)
{
  TextColor = _TextColor; 
  BackColor = _BackColor;
}

/**
  * @brief  Gets the LCD Text and Background colors.
  * @param  _TextColor: pointer to the variable that will contain the Text 
            Color.
  * @param  _BackColor: pointer to the variable that will contain the Background 
            Color.
  * @retval None
  */
void LCD_GetColors(__IO uint16_t *_TextColor, __IO uint16_t *_BackColor)
{
  *_TextColor = TextColor; *_BackColor = BackColor;
}

/**
  * @brief  Sets the Text color.
  * @param  Color: specifies the Text color code RGB(5-6-5).
  * @retval None
  */
void LCD_SetTextColor(__IO uint16_t Color)
{
  TextColor = Color;
}


/**
  * @brief  Sets the Background color.
  * @param  Color: specifies the Background color code RGB(5-6-5).
  * @retval None
  */
void LCD_SetBackColor(__IO uint16_t Color)
{
  BackColor = Color;
}

/**
  * @brief  Sets the Text Font.
  * @param  fonts: specifies the font to be used.
  * @retval None
  */
void LCD_SetFont(sFONT *fonts)
{
  LCD_Currentfonts = fonts;
}


/**
  * @brief  Gets the Text Font.
  * @param  None.
  * @retval the used font.
  */
sFONT *LCD_GetFont(void)
{
  return LCD_Currentfonts;
}

/**
  * @brief  Clears the selected line.
  * @param  Line: the Line to be cleared.
  *   This parameter can be one of the following values:
  *     @arg Linex: where x can be 0..n
  * @retval None
  */
void LCD_ClearLine(uint8_t Line)
{
  uint16_t refcolumn = LCD_PIXEL_WIDTH - 1;
  /* Send the string character by character on lCD */
  while (((refcolumn + 1) & 0xFFFF) >= LCD_Currentfonts->Width)
  {
    /* Display one character on LCD */
    LCD_DisplayChar(Line, refcolumn, ' ');
    /* Decrement the column position by 16 */
    refcolumn -= LCD_Currentfonts->Width;
  }
}

/**
  * @brief  Paints the whole screen.
  * @param  VL: Color to be painted.
  *   This parameter can be one of the following values:
  *     @arg Linex: where x can be 0..n
  * @retval None
  */
/*void Pant(char VL)
{
  int i,j;
  Address_set(0,0,240,320);
  for(i=0;i<320;i++)
  {
    for (j=0;j<480;j++)
    {
      LCD_WriteRAM(VL);
    }
  }
}*/

/**
  * @brief  Sets x and y coordinates which to paint.
  * @param  x1,y1,x2,y2: coordinates to paint.
  *   This parameter can be one of the following values:
  *     @arg Linex: where x can be 0..n
  * @retval None
  */
void Address_set(unsigned int x1,unsigned int y1,unsigned int x2,unsigned int y2)
{
   LCD_WriteRegILI9341(0x2a);
   LCD_WriteRAM(x1>>8);
   LCD_WriteRAM(x1);
   LCD_WriteRAM(x2>>8);
   LCD_WriteRAM(x2);

   LCD_WriteRegILI9341(0x2b);
   LCD_WriteRAM(y1>>8);
   LCD_WriteRAM(y1);
   LCD_WriteRAM(y2>>8);
   LCD_WriteRAM(y2);

   LCD_WriteRegILI9341(0x2C);
}

/**
  * @brief  Clears the hole LCD.
  * @param  Color: the color of the background.
  * @retval None
  */
void LCD_Clear(uint16_t Color)
{
  uint32_t index = 0;
  
  LCD_SetCursor(0x00, 0x00);

  for(index = 0; index < 76800; index++)
  {
    LCD_WriteRAM(Color>>8);
    LCD_WriteRAM(Color);
  }

}


/**
  * @brief  Sets the cursor position.
  * @param  Xpos: specifies the X position.
  * @param  Ypos: specifies the Y position. 
  * @retval None
  */
void LCD_SetCursor(uint8_t Xpos, uint16_t Ypos)
{
  Address_set(((uint16_t)Xpos),Ypos,240,320);
}


/**
  * @brief  Draws a character on LCD.
  * @param  Xpos: the Line where to display the character shape.
  * @param  Ypos: start column address.
  * @param  c: pointer to the character data.
  * @retval None
  */
void LCD_DrawChar(uint8_t Xpos, uint16_t Ypos, const uint16_t *c)
{
  uint32_t index = 0, i = 0;
  uint8_t Xaddress = 0;
   
  Xaddress = Xpos;
  
  LCD_SetCursor(Xaddress, Ypos);
  
  for(index = 0; index < LCD_Currentfonts->Height; index++)
  {

    for(i = 0; i < LCD_Currentfonts->Width; i++)
    {
      if((((c[index] & ((0x80 << ((LCD_Currentfonts->Width / 12 ) * 8 ) ) >> i)) == 0x00) &&(LCD_Currentfonts->Width <= 12))||
        (((c[index] & (0x1 << i)) == 0x00)&&(LCD_Currentfonts->Width > 12 )))

      {
        LCD_WriteRAM(BackColor);
      }
      else
      {
        LCD_WriteRAM(TextColor);
      }
    }

    //Xaddress++;
    Ypos++;
    LCD_SetCursor(Xaddress, Ypos);
  }
}
void LCD_Draw8BitChar(uint8_t Xpos, uint16_t Ypos, const uint8_t *c)
{
  uint32_t index = 0, i = 0, row=0, temp=0;
  uint8_t Xaddress = 0;

  Xaddress = Xpos;

  LCD_SetCursor(Xaddress, Ypos);

