mrwillem/Caravan-Display/Utilities/STM32_EVAL/STM32F103C8T6/stm32f103c8t6_lcd_ili9341.c
  SPI_I2S_SendData(LCD_SPI, 0xFF);

  /* Read upper byte */
  while(SPI_I2S_GetFlagStatus(LCD_SPI, SPI_I2S_FLAG_BSY) != RESET)
  {
  }

  /* Read lower byte */
  while(SPI_I2S_GetFlagStatus(LCD_SPI, SPI_I2S_FLAG_RXNE) == RESET)
  {
  }
  tmp = SPI_I2S_ReceiveData(LCD_SPI);
  
  
  SPI_I2S_SendData(LCD_SPI, 0xFF);
  while(SPI_I2S_GetFlagStatus(LCD_SPI, SPI_I2S_FLAG_BSY) != RESET)
  {
  }

  /* Read lower byte */
  while(SPI_I2S_GetFlagStatus(LCD_SPI, SPI_I2S_FLAG_RXNE) == RESET)
  {
  }

  tmp = ((tmp & 0xFF) << 8) | SPI_I2S_ReceiveData(LCD_SPI);
  LCD_CtrlLinesWrite(LCD_NCS_GPIO_PORT, LCD_NCS_PIN, Bit_SET);

  /* LCD_SPI prescaler: 2 */
  LCD_SPI->CR1 &= 0xFFC7;

  return tmp;
}


/**
  * @brief  Prepare to write to the LCD RAM.
  * @param  None
  * @retval None
  */
void LCD_WriteRAM_Prepare(void)
{
  LCD_WriteRegIndex(LCD_REG_34); /* Select GRAM Reg */

  /* Reset LCD control line(/CS) and Send Start-Byte */
  LCD_nCS_StartByte(START_BYTE | LCD_WRITE_REG);
}


/**
  * @brief  Writes 1 word to the LCD RAM.
  * @param  RGB_Code: the pixel color in RGB mode (5-6-5).
  * @retval None
  */
void LCD_WriteRAMWord(uint16_t RGB_Code)
{


  LCD_WriteRAM(RGB_Code);

}


static void PutPixel(int16_t x, int16_t y)
{
  if(x < 0 || x > 239 || y < 0 || y > 319)
  {
    return;
  }
  LCD_DrawLine(x, y, 1, LCD_DIR_HORIZONTAL);
}

/**
  * @brief  Writes Command on selected ILI9341 register.
  * @param  LCD_Reg: address of the selected register.
  * @retval None
  */
static void LCD_WriteRegILI9341(uint8_t LCD_Reg)
{

 	while(SPI1_BLOCK != SPI_BLOCK_FREE)
	{
	}
	SPI1_BLOCK = SPI_BLOCK_LCD_WRITE_REG;
	LCD_TX_Buffer[0]=(uint8_t)LCD_Reg;
	SPI1_send(1, SPI_BLOCK_LCD_WRITE_REG, (uint32_t)LCD_TX_Buffer, (uint32_t)LCD_RX_Buffer);
	//while(SPI_I2S_GetFlagStatus(SPI1,SPI_I2S_FLAG_BSY) == SET);
	//GPIO_WriteBit(LCD_NCS_GPIO_PORT, LCD_NCS_PIN, Bit_RESET);
/*
	  LCD_CtrlLinesWrite(LCD_RS_GPIO_PORT, LCD_RS_PIN, Bit_RESET);

	  LCD_CtrlLinesWrite(LCD_NCS_GPIO_PORT, LCD_NCS_PIN, Bit_RESET);



	  SPI_I2S_SendData(LCD_SPI, LCD_Reg);

	  while(SPI_I2S_GetFlagStatus(LCD_SPI, SPI_I2S_FLAG_BSY) != RESET)
	  {
	  }
	  LCD_CtrlLinesWrite(LCD_NCS_GPIO_PORT, LCD_NCS_PIN, Bit_SET);
*/

}




/**
  * @brief  Writes to the selected LCD register.
  * @param  LCD_Reg: address of the selected register.
  * @param  LCD_RegValue: value to write to the selected register.
  * @retval None
  */
void LCD_WriteReg(uint8_t LCD_Reg, uint16_t LCD_RegValue)
{
	LCD_WriteRegILI9341(LCD_Reg);
	LCD_WriteRAM((uint8_t)LCD_RegValue);
}


/**
  * @brief  Writes to the LCD RAM.
  * @param  RGB_Code: the pixel color in RGB mode (5-6-5).
  * @retval None
  */
void LCD_WriteRAM(uint16_t RGB_Code)
{

	while(SPI1_BLOCK != SPI_BLOCK_FREE)
	{
	}
	SPI1_BLOCK = SPI_BLOCK_LCD_WRITE_RAM;
	LCD_TX_Buffer[0]=(uint8_t)RGB_Code;
	SPI1_send(1, SPI_BLOCK_LCD_WRITE_RAM, (uint32_t)LCD_TX_Buffer, (uint32_t)LCD_RX_Buffer);
	//while(SPI_I2S_GetFlagStatus(SPI1,SPI_I2S_FLAG_BSY) == SET);
	//GPIO_WriteBit(LCD_NCS_GPIO_PORT, LCD_NCS_PIN, Bit_RESET);
	/*
	  LCD_CtrlLinesWrite(LCD_RS_GPIO_PORT, LCD_RS_PIN, Bit_SET);
	  LCD_CtrlLinesWrite(LCD_NCS_GPIO_PORT, LCD_NCS_PIN, Bit_RESET);

	  SPI_I2S_SendData(LCD_SPI, ((uint8_t)RGB_Code));
	  while(SPI_I2S_GetFlagStatus(LCD_SPI, SPI_I2S_FLAG_BSY) != RESET)
	  {
	  }
	  LCD_CtrlLinesWrite(LCD_NCS_GPIO_PORT, LCD_NCS_PIN, Bit_SET);
	  */
}


/**
  * @brief  Power on the LCD.
  * @param  None
  * @retval None
  */
void LCD_PowerOn(void)
{
  if((LCDType == LCD_ILI9320) || (LCDType == LCD_SPFD5408))
  {
    /* Power On sequence ---------------------------------------------------------*/
    LCD_WriteReg(LCD_REG_16, 0x0000); /* SAP, BT[3:0], AP, DSTB, SLP, STB */
    LCD_WriteReg(LCD_REG_17, 0x0000); /* DC1[2:0], DC0[2:0], VC[2:0] */
    LCD_WriteReg(LCD_REG_18, 0x0000); /* VREG1OUT voltage */
    LCD_WriteReg(LCD_REG_19, 0x0000); /* VDV[4:0] for VCOM amplitude */
    _delay_(20);               /* Dis-charge capacitor power voltage (200ms) */
    LCD_WriteReg(LCD_REG_16, 0x17B0); /* SAP, BT[3:0], AP, DSTB, SLP, STB */
    LCD_WriteReg(LCD_REG_17, 0x0137); /* DC1[2:0], DC0[2:0], VC[2:0] */
    _delay_(5);                /* Delay 50 ms */
    LCD_WriteReg(LCD_REG_18, 0x0139); /* VREG1OUT voltage */
    _delay_(5);                /* delay 50 ms */
    LCD_WriteReg(LCD_REG_19, 0x1d00); /* VDV[4:0] for VCOM amplitude */
    LCD_WriteReg(LCD_REG_41, 0x0013); /* VCM[4:0] for VCOMH */
    _delay_(5);                /* delay 50 ms */
    LCD_WriteReg(LCD_REG_7, 0x0173);  /* 262K color and display ON */
  }
  else if(LCDType == LCD_HX8312)
  {  
    /* Power On Set */
    LCD_WriteReg(LCD_REG_28, 0x73);
    LCD_WriteReg(LCD_REG_36, 0x74);
    LCD_WriteReg(LCD_REG_30, 0x01);
    LCD_WriteReg(LCD_REG_24, 0xC1);
    _delay_(1); /* Delay 10 ms */
    LCD_WriteReg(LCD_REG_24, 0xE1);
    LCD_WriteReg(LCD_REG_24, 0xF1);
    _delay_(6); /* Delay 60 ms */
    LCD_WriteReg(LCD_REG_24, 0xF5);
    _delay_(6); /* Delay 60 ms */
    LCD_WriteReg(LCD_REG_27, 0x09);
    _delay_(1); /* Delay 10 ms */
    LCD_WriteReg(LCD_REG_31, 0x11);
    LCD_WriteReg(LCD_REG_32, 0x0E);
    LCD_WriteReg(LCD_REG_30, 0x81);
    _delay_(1); /* Delay 10 ms */
  }
}


/**
  * @brief  Enables the Display.
  * @param  None
  * @retval None
  */
void LCD_DisplayOn(void)
{
  if((LCDType == LCD_ILI9320) || (LCDType == LCD_SPFD5408))
  {
    /* Display On */
    LCD_WriteReg(LCD_REG_7, 0x0173); /* 262K color and display ON */
  }
  else if(LCDType == LCD_HX8312)
  {  
    LCD_WriteReg(LCD_REG_1, 0x50);
    LCD_WriteReg(LCD_REG_5, 0x04);
    /* Display On */
    LCD_WriteReg(LCD_REG_0, 0x80);
    LCD_WriteReg(LCD_REG_59, 0x01);
    _delay_(4); /* Delay 40 ms */
    LCD_WriteReg(LCD_REG_0, 0x20);
  }  
}


/**
  * @brief  Disables the Display.
  * @param  None
  * @retval None
  */
void LCD_DisplayOff(void)
{
	  /* Set Display Off */
	  LCD_WriteRegILI9341(0x28);
	  _delay_(4); /* Delay 40 ms */
	  /* Set Sleep Mode */
	  LCD_WriteRegILI9341(0x10);
}


/**
  * @brief  Configures LCD control lines in Output Push-Pull mode.
  * @param  None
  * @retval None
  */
void LCD_CtrlLinesConfig(void)
{
  GPIO_InitTypeDef GPIO_InitStructure;

